importing Pandas

In [2]:
import pandas as pd

In [3]:
pd.DataFrame({'Yes': [50,21], 'No': [131,2]})

   Yes   No
0   50  131
1   21    2

In [4]:
Dataset = pd.read_csv("Data.csv")

In [5]:
Dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [6]:
Dataset.shape

(10, 4)

In [7]:
Dataset.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [8]:
  Dataset["Country"]

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [9]:
Dataset["Country"][0]

'France'

In [10]:
Dataset["Country"][0:3]

0     France
1      Spain
2    Germany
Name: Country, dtype: object

In [11]:
Dataset["Age"]

0    44.0
1    27.0
2    30.0
3    38.0
4    40.0
5    35.0
6     NaN
7    48.0
8    50.0
9    37.0
Name: Age, dtype: float64

In [12]:
Dataset["Salary"][3]

61000.0

In [13]:
Dataset["Country"][6]

'Spain'

In [14]:
Dataset.Country == "Germany"

0    False
1    False
2     True
3    False
4     True
5    False
6    False
7    False
8     True
9    False
Name: Country, dtype: bool

In [15]:
Dataset.loc[Dataset.Country == "Germany"]

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
4  Germany  40.0      NaN       Yes
8  Germany  50.0  83000.0        No

In [16]:
Germany_column = Dataset.loc[Dataset.Country == "Germany"]

In [17]:
Germany_column

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
4  Germany  40.0      NaN       Yes
8  Germany  50.0  83000.0        No

In [18]:
Germany_column.to_csv('germanyData.csv')

In [19]:
Dataset.loc[Dataset.Salary.isnull()]

   Country   Age  Salary Purchased
4  Germany  40.0     NaN       Yes

In [20]:
Dataset.loc[Dataset.Salary.notnull()]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [21]:
Dataset["Salary"]=10000

In [22]:
Dataset

   Country   Age  Salary Purchased
0   France  44.0   10000        No
1    Spain  27.0   10000       Yes
2  Germany  30.0   10000        No
3    Spain  38.0   10000        No
4  Germany  40.0   10000       Yes
5   France  35.0   10000       Yes
6    Spain   NaN   10000        No
7   France  48.0   10000       Yes
8  Germany  50.0   10000        No
9   France  37.0   10000       Yes

In [28]:
#assigning a value to a specific row

In [29]:
Dataset[(0) ,"Salary"] = 4000

In [27]:
Dataset

   Country   Age  Salary Purchased  (0, Salary)
0   France  44.0   10000        No         4000
1    Spain  27.0   10000       Yes         4000
2  Germany  30.0   10000        No         4000
3    Spain  38.0   10000        No         4000
4  Germany  40.0   10000       Yes         4000
5   France  35.0   10000       Yes         4000
6    Spain   NaN   10000        No         4000
7   France  48.0   10000       Yes         4000
8  Germany  50.0   10000        No         4000
9   France  37.0   10000       Yes         4000

In [30]:
Dataset.loc[0,"salary"]= 15000

In [31]:
Dataset

   Country   Age  Salary Purchased  (0, Salary)   salary
0   France  44.0   10000        No         4000  15000.0
1    Spain  27.0   10000       Yes         4000      NaN
2  Germany  30.0   10000        No         4000      NaN
3    Spain  38.0   10000        No         4000      NaN
4  Germany  40.0   10000       Yes         4000      NaN
5   France  35.0   10000       Yes         4000      NaN
6    Spain   NaN   10000        No         4000      NaN
7   France  48.0   10000       Yes         4000      NaN
8  Germany  50.0   10000        No         4000      NaN
9   France  37.0   10000       Yes         4000      NaN

In [36]:
Dataset.salary.describe()

count        1.0
mean     15000.0
std          NaN
min      15000.0
25%      15000.0
50%      15000.0
75%      15000.0
max      15000.0
Name: salary, dtype: float64

In [39]:
Dataset.Country.unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [40]:
Dataset.Salary.dtype

dtype('int64')

In [42]:
Dataset.dtypes

Country         object
Age            float64
Salary           int64
Purchased       object
(0, Salary)      int64
salary         float64
dtype: object